{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "e92904a5-a1c5-4a9d-a958-84b5c722bcff",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/Users/Rachel/opt/anaconda3/lib/python3.8/site-packages/rdflib_jsonld/__init__.py:9: DeprecationWarning: The rdflib-jsonld package has been integrated into rdflib as of rdflib==6.0.1.  Please remove rdflib-jsonld from your project's dependencies.\n",
      "  warnings.warn(\n"
     ]
    }
   ],
   "source": [
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\")\n",
    "from rdflib import Graph\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, N3\n",
    "from pprint import pprint\n",
    "import wikidata_plain_sparql as wikidata\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "import time\n",
    "import pickle\n",
    "from tqdm import trange"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c117ffe-b3e4-46d7-b740-5c699fabd297",
   "metadata": {},
   "source": [
    "## Language editions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8c35e2dc-e034-4f24-aae9-f9785f09e4bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "df = pd.read_csv('data/name_list.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "9aa5a3e5-3de9-444f-9fc2-3baa5b157c7f",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████| 594/594 [08:29<00:00,  1.17it/s]\n"
     ]
    }
   ],
   "source": [
    "df['lang'] = ''\n",
    "df['n_lang'] = ''\n",
    "for i in trange(len(df)):\n",
    "    wiki = df.loc[i,'Wikidata_Q']\n",
    "    if type(wiki)==str:\n",
    "        while True:\n",
    "            try:\n",
    "                a = wikidata.query(f'''\n",
    "SELECT DISTINCT ?lang ?name \n",
    "WHERE {{\n",
    "  ?article schema:about wd:{wiki} . hint:Prior hint:runFirst true.\n",
    "  ?article schema:inLanguage ?lang ;\n",
    "    schema:name ?name ;\n",
    "    schema:isPartOf [ wikibase:wikiGroup \"wikipedia\" ] .\n",
    "  FILTER (!CONTAINS(?name, ':')) .\n",
    "}}\n",
    "''')\n",
    "                time.sleep(0.5)\n",
    "                break\n",
    "            except HTTPError:\n",
    "                time.sleep(20)\n",
    "                continue\n",
    "        df.at[i,'lang'] = a['lang'].to_list()\n",
    "        df.at[i, 'n_lang'] = len(a['lang'].to_list())\n",
    "        \n",
    "        # if i%10==0:\n",
    "        #     time.sleep(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "bb431a09-7075-4cb8-9fc5-e563d379d218",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>Wikipedia_URL</th>\n",
       "      <th>Wikidata_URL</th>\n",
       "      <th>Wikidata_Q</th>\n",
       "      <th>lang</th>\n",
       "      <th>n_lang</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ceolwulf</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q729480</td>\n",
       "      <td>Q729480</td>\n",
       "      <td>[bar, ca, de, el, en, eo, es, fr, gl, it, la, ...</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bede</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bede</td>\n",
       "      <td>http://www.wikidata.org/entity/Q154938</td>\n",
       "      <td>Q154938</td>\n",
       "      <td>[yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...</td>\n",
       "      <td>68</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Albinus</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Albinus_(abbot)</td>\n",
       "      <td>http://www.wikidata.org/entity/Q16002399</td>\n",
       "      <td>Q16002399</td>\n",
       "      <td>[en, es, fr, pt]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Name wikidata                                      Wikipedia_URL  \\\n",
       "0  Ceolwulf        Y  https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...   \n",
       "1      Bede        Y                 https://en.wikipedia.org/wiki/Bede   \n",
       "2   Albinus        Y      https://en.wikipedia.org/wiki/Albinus_(abbot)   \n",
       "\n",
       "                               Wikidata_URL Wikidata_Q  \\\n",
       "0    http://www.wikidata.org/entity/Q729480    Q729480   \n",
       "1    http://www.wikidata.org/entity/Q154938    Q154938   \n",
       "2  http://www.wikidata.org/entity/Q16002399  Q16002399   \n",
       "\n",
       "                                                lang n_lang  \n",
       "0  [bar, ca, de, el, en, eo, es, fr, gl, it, la, ...     15  \n",
       "1  [yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...     68  \n",
       "2                                   [en, es, fr, pt]      4  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "8c4ea46a-550c-4afc-acd4-37ffb12c46dd",
   "metadata": {},
   "outputs": [],
   "source": [
    "pickle.dump(df, open( \"data/df.p\", \"wb\" ))\n",
    "df = pickle.load(open( \"data/df.p\", \"rb\" ))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9f536f8e-64b8-4270-a513-1bec8b0ab47a",
   "metadata": {},
   "source": [
    "## Outlinks + Inlinks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "755e53a6-9295-4e27-8f73-e00acf3d9066",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████| 594/594 [10:03<00:00,  1.02s/it]\n"
     ]
    }
   ],
   "source": [
    "for i in trange(len(df)):\n",
    "    wiki_q = df.loc[i,'Wikidata_Q']\n",
    "    if type(wiki_q)==str and len(wiki_q)>1:\n",
    "        while True:\n",
    "            try:\n",
    "                sparql = SPARQLWrapper('https://dbpedia.org/sparql')\n",
    "                sparql.setQuery(f\"\"\"\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "SELECT DISTINCT ?pLabel ?wikidata \n",
    "WHERE {{\n",
    "  ?person_db owl:sameAs wd:{wiki_q}. \n",
    "  ?person_db dbo:wikiPageWikiLink ?outlinks_to_person.\n",
    "  ?outlinks_to_person rdf:type dbo:Person.\n",
    "  ?outlinks_to_person rdfs:label ?pLabel.\n",
    "  FILTER(LANG(?pLabel) = \"en\").\n",
    "  ?outlinks_to_person owl:sameAs ?wikidata.\n",
    "  FILTER(regex(str(?wikidata), \"www.wikidata.org\" ) )\n",
    "}}\n",
    "\"\"\")\n",
    "                time.sleep(0.5)\n",
    "                break\n",
    "            except HTTPError:\n",
    "                time.sleep(20)\n",
    "                continue\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        qres = sparql.query().convert()\n",
    "        df.loc[i,'Outlinks'] = str({i['wikidata']['value'].split('/')[-1]:i['pLabel']['value'] for i in qres['results']['bindings']})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ab06c4fd-39e2-4319-8955-4c8608693a5a",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████| 594/594 [10:08<00:00,  1.02s/it]\n"
     ]
    }
   ],
   "source": [
    "for i in trange(len(df)):\n",
    "    wiki_q = df.loc[i,'Wikidata_Q']\n",
    "    if type(wiki_q)==str and len(wiki_q)>1:\n",
    "        while True:\n",
    "            try:\n",
    "                sparql = SPARQLWrapper('https://dbpedia.org/sparql')\n",
    "                sparql.setQuery(f\"\"\"\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "SELECT DISTINCT ?pLabel ?wikidata\n",
    "WHERE {{\n",
    "  ?person_db owl:sameAs wd:{wiki_q}.\n",
    "  ?inlinks_from_person dbo:wikiPageWikiLink ?person_db.\n",
    "  ?inlinks_from_person rdf:type dbo:Person.\n",
    "  ?inlinks_from_person rdfs:label ?pLabel.\n",
    "  FILTER(LANG(?pLabel) = \"en\").\n",
    "  ?inlinks_from_person owl:sameAs ?wikidata.\n",
    "  FILTER(regex(str(?wikidata), \"www.wikidata.org\" ) )\n",
    "}}\n",
    "\"\"\")\n",
    "                \n",
    "                time.sleep(0.5)\n",
    "                break\n",
    "            except HTTPError:\n",
    "                time.sleep(20)\n",
    "                continue\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        qres = sparql.query().convert()\n",
    "        df.loc[i,'Inlinks'] = str({i['wikidata']['value'].split('/')[-1]:i['pLabel']['value'] for i in qres['results']['bindings']})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "885944b8-c9d1-4783-a56f-72a45b4ba4f8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>Wikipedia_URL</th>\n",
       "      <th>Wikidata_URL</th>\n",
       "      <th>Wikidata_Q</th>\n",
       "      <th>lang</th>\n",
       "      <th>n_lang</th>\n",
       "      <th>Outlinks</th>\n",
       "      <th>Inlinks</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ceolwulf</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q729480</td>\n",
       "      <td>Q729480</td>\n",
       "      <td>[bar, ca, de, el, en, eo, es, fr, gl, it, la, ...</td>\n",
       "      <td>15</td>\n",
       "      <td>{'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...</td>\n",
       "      <td>{'Q737618': 'Aldfrith of Northumbria', 'Q15493...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bede</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bede</td>\n",
       "      <td>http://www.wikidata.org/entity/Q154938</td>\n",
       "      <td>Q154938</td>\n",
       "      <td>[yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...</td>\n",
       "      <td>68</td>\n",
       "      <td>{'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...</td>\n",
       "      <td>{'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Albinus</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Albinus_(abbot)</td>\n",
       "      <td>http://www.wikidata.org/entity/Q16002399</td>\n",
       "      <td>Q16002399</td>\n",
       "      <td>[en, es, fr, pt]</td>\n",
       "      <td>4</td>\n",
       "      <td>{'Q1274084': 'Adrian of Canterbury', 'Q154938'...</td>\n",
       "      <td>{'Q154938': 'Bede'}</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       Name wikidata                                      Wikipedia_URL  \\\n",
       "0  Ceolwulf        Y  https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...   \n",
       "1      Bede        Y                 https://en.wikipedia.org/wiki/Bede   \n",
       "2   Albinus        Y      https://en.wikipedia.org/wiki/Albinus_(abbot)   \n",
       "\n",
       "                               Wikidata_URL Wikidata_Q  \\\n",
       "0    http://www.wikidata.org/entity/Q729480    Q729480   \n",
       "1    http://www.wikidata.org/entity/Q154938    Q154938   \n",
       "2  http://www.wikidata.org/entity/Q16002399  Q16002399   \n",
       "\n",
       "                                                lang n_lang  \\\n",
       "0  [bar, ca, de, el, en, eo, es, fr, gl, it, la, ...     15   \n",
       "1  [yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...     68   \n",
       "2                                   [en, es, fr, pt]      4   \n",
       "\n",
       "                                            Outlinks  \\\n",
       "0  {'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...   \n",
       "1  {'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...   \n",
       "2  {'Q1274084': 'Adrian of Canterbury', 'Q154938'...   \n",
       "\n",
       "                                             Inlinks  \n",
       "0  {'Q737618': 'Aldfrith of Northumbria', 'Q15493...  \n",
       "1  {'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...  \n",
       "2                                {'Q154938': 'Bede'}  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(3)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "8b020d77-fc15-43db-85c5-ab3586048255",
   "metadata": {},
   "outputs": [],
   "source": [
    "pickle.dump(df, open( \"data/df.p\", \"wb\" ))\n",
    "df = pickle.load(open( \"data/df.p\", \"rb\" ))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04d25982-1da8-44ce-a931-a738b26195b2",
   "metadata": {},
   "source": [
    "## Properties"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "c262edd4-3bd2-4946-bdf2-0bb735983c57",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████| 594/594 [07:56<00:00,  1.25it/s]\n"
     ]
    }
   ],
   "source": [
    "columns = ['gender_Q', 'gender', \\\n",
    "           'occupation_Q', 'occupation', \\\n",
    "           'religion_Q', 'religion', \\\n",
    "           'date_of_birth_Q', 'date_of_birth', \\\n",
    "           'date_of_death_Q', 'date_of_death', \\\n",
    "           'place_of_birth_Q', 'place_of_birth', \\\n",
    "           'place_of_death_Q', 'place_of_death', \\\n",
    "           'spouse_Q', 'spouse', 'child_Q', 'child', \\\n",
    "           'father_Q', 'father', 'mother_Q', 'mother']\n",
    "df = pd.concat([df, pd.DataFrame(columns=columns)])\n",
    "\n",
    "for i in trange(len(df)):\n",
    "    wiki = df.loc[i,'Wikidata_Q']\n",
    "    if type(wiki)==str and wiki!='':\n",
    "        while True:\n",
    "            try:\n",
    "                a = wikidata.query(f'''\n",
    "select ?gender ?genderLabel \\\n",
    "?occupation ?occupationLabel \\\n",
    "?religion ?religionLabel \\\n",
    "?date_of_birth ?date_of_birthLabel \\\n",
    "?date_of_death ?date_of_deathLabel \\\n",
    "?place_of_birth ?place_of_birthLabel \\\n",
    "?place_of_death ?place_of_deathLabel \\\n",
    "?spouse ?spouseLabel ?child ?childLabel \\\n",
    "?father ?fatherLabel ?mother ?motherLabel\n",
    "where {{\n",
    "  Optional {{wd:{wiki} wdt:P21 ?gender}}\n",
    "  Optional {{wd:{wiki} wdt:P569 ?date_of_birth}}\n",
    "  Optional {{wd:{wiki} wdt:P19 ?place_of_birth}}\n",
    "  Optional {{wd:{wiki} wdt:P570 ?date_of_death}}\n",
    "  Optional {{wd:{wiki} wdt:P20 ?place_of_death}}\n",
    "  Optional {{wd:{wiki} wdt:P106 ?occupation}}\n",
    "  Optional {{wd:{wiki} wdt:P140 ?religion}}\n",
    "  Optional {{wd:{wiki} wdt:P26 ?spouse}}\n",
    "  Optional {{wd:{wiki} wdt:P40 ?child}}\n",
    "  Optional {{wd:{wiki} wdt:P22 ?father}}\n",
    "  Optional {{wd:{wiki} wdt:P25 ?mother}}\n",
    "  SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\".}}\n",
    "  }}'''\n",
    ")\n",
    "                time.sleep(0.5)\n",
    "                break\n",
    "            except HTTPError:\n",
    "                time.sleep(20)\n",
    "                continue\n",
    "        a.set_axis(columns,axis='columns', inplace=True)\n",
    "        for col in columns: \n",
    "            l = list(set(a[col]))\n",
    "            if len(l)>1:\n",
    "                df.at[i,col] = l\n",
    "            else:\n",
    "                df.at[i,col] = l[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "ad7001b1-d589-4188-95fb-cbbe24baa51c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>Wikipedia_URL</th>\n",
       "      <th>Wikidata_URL</th>\n",
       "      <th>Wikidata_Q</th>\n",
       "      <th>lang</th>\n",
       "      <th>n_lang</th>\n",
       "      <th>Outlinks</th>\n",
       "      <th>Inlinks</th>\n",
       "      <th>gender_Q</th>\n",
       "      <th>...</th>\n",
       "      <th>place_of_death_Q</th>\n",
       "      <th>place_of_death</th>\n",
       "      <th>spouse_Q</th>\n",
       "      <th>spouse</th>\n",
       "      <th>child_Q</th>\n",
       "      <th>child</th>\n",
       "      <th>father_Q</th>\n",
       "      <th>father</th>\n",
       "      <th>mother_Q</th>\n",
       "      <th>mother</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ceolwulf</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q729480</td>\n",
       "      <td>Q729480</td>\n",
       "      <td>[bar, ca, de, el, en, eo, es, fr, gl, it, la, ...</td>\n",
       "      <td>15</td>\n",
       "      <td>{'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...</td>\n",
       "      <td>{'Q737618': 'Aldfrith of Northumbria', 'Q15493...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q213804</td>\n",
       "      <td>Lindisfarne</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q75451525</td>\n",
       "      <td>Cuðwin (?)</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bede</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bede</td>\n",
       "      <td>http://www.wikidata.org/entity/Q154938</td>\n",
       "      <td>Q154938</td>\n",
       "      <td>[yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...</td>\n",
       "      <td>68</td>\n",
       "      <td>{'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...</td>\n",
       "      <td>{'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q782155</td>\n",
       "      <td>Jarrow</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Albinus</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Albinus_(abbot)</td>\n",
       "      <td>http://www.wikidata.org/entity/Q16002399</td>\n",
       "      <td>Q16002399</td>\n",
       "      <td>[en, es, fr, pt]</td>\n",
       "      <td>4</td>\n",
       "      <td>{'Q1274084': 'Adrian of Canterbury', 'Q154938'...</td>\n",
       "      <td>{'Q154938': 'Bede'}</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3 rows × 31 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Name wikidata                                      Wikipedia_URL  \\\n",
       "0  Ceolwulf        Y  https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...   \n",
       "1      Bede        Y                 https://en.wikipedia.org/wiki/Bede   \n",
       "2   Albinus        Y      https://en.wikipedia.org/wiki/Albinus_(abbot)   \n",
       "\n",
       "                               Wikidata_URL Wikidata_Q  \\\n",
       "0    http://www.wikidata.org/entity/Q729480    Q729480   \n",
       "1    http://www.wikidata.org/entity/Q154938    Q154938   \n",
       "2  http://www.wikidata.org/entity/Q16002399  Q16002399   \n",
       "\n",
       "                                                lang n_lang  \\\n",
       "0  [bar, ca, de, el, en, eo, es, fr, gl, it, la, ...     15   \n",
       "1  [yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...     68   \n",
       "2                                   [en, es, fr, pt]      4   \n",
       "\n",
       "                                            Outlinks  \\\n",
       "0  {'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...   \n",
       "1  {'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...   \n",
       "2  {'Q1274084': 'Adrian of Canterbury', 'Q154938'...   \n",
       "\n",
       "                                             Inlinks  \\\n",
       "0  {'Q737618': 'Aldfrith of Northumbria', 'Q15493...   \n",
       "1  {'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...   \n",
       "2                                {'Q154938': 'Bede'}   \n",
       "\n",
       "                                  gender_Q  ...  \\\n",
       "0  http://www.wikidata.org/entity/Q6581097  ...   \n",
       "1  http://www.wikidata.org/entity/Q6581097  ...   \n",
       "2  http://www.wikidata.org/entity/Q6581097  ...   \n",
       "\n",
       "                         place_of_death_Q place_of_death spouse_Q spouse  \\\n",
       "0  http://www.wikidata.org/entity/Q213804    Lindisfarne      NaN    NaN   \n",
       "1  http://www.wikidata.org/entity/Q782155         Jarrow      NaN    NaN   \n",
       "2                                     NaN            NaN      NaN    NaN   \n",
       "\n",
       "  child_Q child                                  father_Q      father  \\\n",
       "0     NaN   NaN  http://www.wikidata.org/entity/Q75451525  Cuðwin (?)   \n",
       "1     NaN   NaN                                       NaN         NaN   \n",
       "2     NaN   NaN                                       NaN         NaN   \n",
       "\n",
       "  mother_Q mother  \n",
       "0      NaN    NaN  \n",
       "1      NaN    NaN  \n",
       "2      NaN    NaN  \n",
       "\n",
       "[3 rows x 31 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(3)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85c4a486-86d5-4612-bdc1-9fd27678d86b",
   "metadata": {},
   "source": [
    "## Notability"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "049fa7b2-8875-441c-a9e2-30d2a685206f",
   "metadata": {},
   "outputs": [],
   "source": [
    "notability_ids = wikidata.query(f'''\n",
    "SELECT DISTINCT ?itemLabel WHERE {{\n",
    "  SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE]\". }}\n",
    "  {{\n",
    "    SELECT DISTINCT ?item WHERE {{\n",
    "      ?item p:P31 ?statement0.\n",
    "      ?statement0 (ps:P31/(wdt:P279*)) wd:Q62589316.\n",
    "    }}\n",
    "    LIMIT 2000\n",
    "  }}\n",
    "}}\n",
    "        ''')\n",
    "notability_ids = notability_ids['itemLabel'].to_list()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "52118c40-f583-4583-bac2-b361c7078a98",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|███████████████████████████████████████████████████| 594/594 [09:58<00:00,  1.01s/it]\n"
     ]
    }
   ],
   "source": [
    "df['prop_list'] = ''\n",
    "df['prop_notability_list'] = ''\n",
    "df['n_prop_list'] = ''\n",
    "df['n_prop_notability_list'] = ''\n",
    "for i in trange(len(df)):\n",
    "    wiki = df.loc[i,'Wikidata_Q']\n",
    "    if type(wiki)==str:\n",
    "        while True:\n",
    "            try:\n",
    "                a = wikidata.query(f'''\n",
    "SELECT  ?p ?wdLabel ?ps ?ps_ ?ps_Label ?ps_Description ?pq_unitLabel \n",
    "WHERE {{\n",
    "  VALUES ?item {{\n",
    "    wd:{wiki}\n",
    "  }}\n",
    "  ?item ?p ?statement.   \n",
    "  ?statement ?ps ?ps_.   \n",
    "  ?wd wikibase:claim ?p;     \n",
    "      wikibase:statementProperty ?ps.   \n",
    "OPTIONAL {{\n",
    "  ?statement ?pq ?pq_.\n",
    "  ?wdpq wikibase:qualifier ?pq.\n",
    "  ?statement ?pqv [wikibase:quantityUnit ?pq_unit]\n",
    "}}\n",
    "SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}}}\n",
    "        ''')\n",
    "                time.sleep(0.5)\n",
    "                break\n",
    "            except HTTPError:\n",
    "                time.sleep(20)\n",
    "                continue\n",
    "        df.at[i,'prop_list'] = [url.split(\"/\")[-1] for url in a.p]\n",
    "        df.at[i,'prop_notability_list'] = [url.split(\"/\")[-1] for url in a.p if url.split(\"/\")[-1] in notability_ids]\n",
    "        df.at[i,'n_prop_list'] = len(df.at[i,'prop_list'])\n",
    "        df.at[i,'n_prop_notability_list'] = len(df.at[i,'prop_notability_list'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "96d0d192-5f59-44bb-9db6-bc5636f08fdc",
   "metadata": {},
   "outputs": [],
   "source": [
    "pickle.dump(df, open( \"data/df.p\", \"wb\" ))\n",
    "df = pickle.load(open( \"data/df.p\", \"rb\" ))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "6d57cd74-3bf4-4175-b3cf-6fa4d2182ae6",
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_csv('data/data.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9b76bba3-5c80-42cd-bff0-e0d8963f90bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>wikidata</th>\n",
       "      <th>Wikipedia_URL</th>\n",
       "      <th>Wikidata_URL</th>\n",
       "      <th>Wikidata_Q</th>\n",
       "      <th>lang</th>\n",
       "      <th>n_lang</th>\n",
       "      <th>Outlinks</th>\n",
       "      <th>Inlinks</th>\n",
       "      <th>gender_Q</th>\n",
       "      <th>...</th>\n",
       "      <th>child_Q</th>\n",
       "      <th>child</th>\n",
       "      <th>father_Q</th>\n",
       "      <th>father</th>\n",
       "      <th>mother_Q</th>\n",
       "      <th>mother</th>\n",
       "      <th>prop_list</th>\n",
       "      <th>prop_notability_list</th>\n",
       "      <th>n_prop_list</th>\n",
       "      <th>n_prop_notability_list</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Ceolwulf</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q729480</td>\n",
       "      <td>Q729480</td>\n",
       "      <td>[bar, ca, de, el, en, eo, es, fr, gl, it, la, ...</td>\n",
       "      <td>15</td>\n",
       "      <td>{'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...</td>\n",
       "      <td>{'Q737618': 'Aldfrith of Northumbria', 'Q15493...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>http://www.wikidata.org/entity/Q75451525</td>\n",
       "      <td>Cuðwin (?)</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[P27, P646, P569, P1185, P1343, P227, P97, P57...</td>\n",
       "      <td>[P227, P6126, P7902, P1415]</td>\n",
       "      <td>29</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bede</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Bede</td>\n",
       "      <td>http://www.wikidata.org/entity/Q154938</td>\n",
       "      <td>Q154938</td>\n",
       "      <td>[yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...</td>\n",
       "      <td>68</td>\n",
       "      <td>{'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...</td>\n",
       "      <td>{'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[P1066, P8849, P6868, P8065, P106, P1889, P688...</td>\n",
       "      <td>[P4342, P7796, P5034, P227, P6126, P1263, P147...</td>\n",
       "      <td>242</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Albinus</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Albinus_(abbot)</td>\n",
       "      <td>http://www.wikidata.org/entity/Q16002399</td>\n",
       "      <td>Q16002399</td>\n",
       "      <td>[en, es, fr, pt]</td>\n",
       "      <td>4</td>\n",
       "      <td>{'Q1274084': 'Adrian of Canterbury', 'Q154938'...</td>\n",
       "      <td>{'Q154938': 'Bede'}</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[P39, P4223, P31, P646, P214, P21, P570, P3241...</td>\n",
       "      <td>[P227, P1415]</td>\n",
       "      <td>14</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Theodore of Canterbury</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Theodore_of_Tarsus</td>\n",
       "      <td>http://www.wikidata.org/entity/Q504529</td>\n",
       "      <td>Q504529</td>\n",
       "      <td>[uk, ko, ang, arz, de, el, en, eo, es, fi, fr,...</td>\n",
       "      <td>23</td>\n",
       "      <td>{'Q1274084': 'Adrian of Canterbury', 'Q154938'...</td>\n",
       "      <td>{'Q1274084': 'Adrian of Canterbury', 'Q225857'...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[P10242, P10141, P18, P10553, P10799, P1317, P...</td>\n",
       "      <td>[P6126, P244, P4286, P1417, P227, P691, P1415,...</td>\n",
       "      <td>81</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hadrian</td>\n",
       "      <td>Y</td>\n",
       "      <td>https://en.wikipedia.org/wiki/Adrian_of_Canter...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q1274084</td>\n",
       "      <td>Q1274084</td>\n",
       "      <td>[sv, de, en, eo, es, fr, hr, it, la, lt, nb, p...</td>\n",
       "      <td>15</td>\n",
       "      <td>{'Q154938': 'Bede', 'Q552201': 'Benedict Bisco...</td>\n",
       "      <td>{'Q16002399': 'Albinus (abbot)', 'Q709718': 'A...</td>\n",
       "      <td>http://www.wikidata.org/entity/Q6581097</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[P10553, P10799, P8080, P4342, P8366, P3241, P...</td>\n",
       "      <td>[P4342, P4286, P1415, P6126, P227, P7902]</td>\n",
       "      <td>33</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 35 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                     Name wikidata  \\\n",
       "0                Ceolwulf        Y   \n",
       "1                    Bede        Y   \n",
       "2                 Albinus        Y   \n",
       "3  Theodore of Canterbury        Y   \n",
       "4                 Hadrian        Y   \n",
       "\n",
       "                                       Wikipedia_URL  \\\n",
       "0  https://en.wikipedia.org/wiki/Ceolwulf_of_Nort...   \n",
       "1                 https://en.wikipedia.org/wiki/Bede   \n",
       "2      https://en.wikipedia.org/wiki/Albinus_(abbot)   \n",
       "3   https://en.wikipedia.org/wiki/Theodore_of_Tarsus   \n",
       "4  https://en.wikipedia.org/wiki/Adrian_of_Canter...   \n",
       "\n",
       "                               Wikidata_URL Wikidata_Q  \\\n",
       "0    http://www.wikidata.org/entity/Q729480    Q729480   \n",
       "1    http://www.wikidata.org/entity/Q154938    Q154938   \n",
       "2  http://www.wikidata.org/entity/Q16002399  Q16002399   \n",
       "3    http://www.wikidata.org/entity/Q504529    Q504529   \n",
       "4   http://www.wikidata.org/entity/Q1274084   Q1274084   \n",
       "\n",
       "                                                lang n_lang  \\\n",
       "0  [bar, ca, de, el, en, eo, es, fr, gl, it, la, ...     15   \n",
       "1  [yue, ast, ca, cy, da, en, es, eu, gl, nl, nn,...     68   \n",
       "2                                   [en, es, fr, pt]      4   \n",
       "3  [uk, ko, ang, arz, de, el, en, eo, es, fi, fr,...     23   \n",
       "4  [sv, de, en, eo, es, fr, hr, it, la, lt, nb, p...     15   \n",
       "\n",
       "                                            Outlinks  \\\n",
       "0  {'Q154938': 'Bede', 'Q338268': 'Acca of Hexham...   \n",
       "1  {'Q43689': 'Ambrose', 'Q254896': 'Anastasius o...   \n",
       "2  {'Q1274084': 'Adrian of Canterbury', 'Q154938'...   \n",
       "3  {'Q1274084': 'Adrian of Canterbury', 'Q154938'...   \n",
       "4  {'Q154938': 'Bede', 'Q552201': 'Benedict Bisco...   \n",
       "\n",
       "                                             Inlinks  \\\n",
       "0  {'Q737618': 'Aldfrith of Northumbria', 'Q15493...   \n",
       "1  {'Q671299': 'Amphibalus', 'Q254896': 'Anastasi...   \n",
       "2                                {'Q154938': 'Bede'}   \n",
       "3  {'Q1274084': 'Adrian of Canterbury', 'Q225857'...   \n",
       "4  {'Q16002399': 'Albinus (abbot)', 'Q709718': 'A...   \n",
       "\n",
       "                                  gender_Q  ... child_Q child  \\\n",
       "0  http://www.wikidata.org/entity/Q6581097  ...     NaN   NaN   \n",
       "1  http://www.wikidata.org/entity/Q6581097  ...     NaN   NaN   \n",
       "2  http://www.wikidata.org/entity/Q6581097  ...     NaN   NaN   \n",
       "3  http://www.wikidata.org/entity/Q6581097  ...     NaN   NaN   \n",
       "4  http://www.wikidata.org/entity/Q6581097  ...     NaN   NaN   \n",
       "\n",
       "                                   father_Q      father mother_Q mother  \\\n",
       "0  http://www.wikidata.org/entity/Q75451525  Cuðwin (?)      NaN    NaN   \n",
       "1                                       NaN         NaN      NaN    NaN   \n",
       "2                                       NaN         NaN      NaN    NaN   \n",
       "3                                       NaN         NaN      NaN    NaN   \n",
       "4                                       NaN         NaN      NaN    NaN   \n",
       "\n",
       "                                           prop_list  \\\n",
       "0  [P27, P646, P569, P1185, P1343, P227, P97, P57...   \n",
       "1  [P1066, P8849, P6868, P8065, P106, P1889, P688...   \n",
       "2  [P39, P4223, P31, P646, P214, P21, P570, P3241...   \n",
       "3  [P10242, P10141, P18, P10553, P10799, P1317, P...   \n",
       "4  [P10553, P10799, P8080, P4342, P8366, P3241, P...   \n",
       "\n",
       "                                prop_notability_list n_prop_list  \\\n",
       "0                        [P227, P6126, P7902, P1415]          29   \n",
       "1  [P4342, P7796, P5034, P227, P6126, P1263, P147...         242   \n",
       "2                                      [P227, P1415]          14   \n",
       "3  [P6126, P244, P4286, P1417, P227, P691, P1415,...          81   \n",
       "4          [P4342, P4286, P1415, P6126, P227, P7902]          33   \n",
       "\n",
       "  n_prop_notability_list  \n",
       "0                      4  \n",
       "1                     21  \n",
       "2                      2  \n",
       "3                      8  \n",
       "4                      6  \n",
       "\n",
       "[5 rows x 35 columns]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.head(5)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "12b6abcd-9aa9-446d-8416-956cc8fa609a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
